Repository: advancedresearch/lojban
Catalog: assets/en-jbo.tmx
Source language: en
Languages: jbo

source: I didn't know Tom had a brother.
jbo: mi na pu djuno lo nu la tom cu se bruna

source: I didn't know Tom had a dog.
jbo: mi na pu djuno lo nu la tom cu ralte lo gerku

source: I didn't know Tom was a doctor.
jbo: mi na pu djuno lo nu la tom cu mikce prenu

source: I didn't know what I was doing.
jbo: mi na pu djuno lo nu mi ca ca'o zukte makau

source: Success usually requires hard work.
jbo: lo se snada so'eroi se sarcu lo nu carmi gunka

source: We only use Spanish at home.
jbo: mi'ai pilno lo sanbau po'o bu'u lo zdani

source: Tom didn't read the book.
jbo: la tom pu na tcidu le cukta

source: I don't know how many minutes we've got.
jbo: mi na'e djuno lo du'u mi nu'o pilno lo mentu be li xo kau

source: I don't know how many more times I'll be able to do this.
jbo: mi na'e djuno lo du'u mi kakne lo nu ba xo kau roi zukte ko'a

source: I don't know how much money we've got.
jbo: mi nalju'o lo du'u lo rupnu be li xo kau mi kansa

source: I don't know how to deal with this.
jbo: mi na'e djuno lo du'u .ei spuda ko'a ma kau

source: I don't know how to describe it.
jbo: skicu ko'a fo zo'e .uanai

source: I don't know how to do it.
jbo: tadji ko'a fa zo'e .uanai

source: I don't know how to do this.
jbo: mi na'e djuno fi lo tadji be ti

source: I don't know how to handle this.
jbo: mi na'e djuno fi lo te spuda be ti

source: I like music.
jbo: mi nelci lo zgike

source: I don't know what I was expecting.
jbo: mi tolsanji da poi mi pu denpa

source: I don't know what I was thinking.
jbo: mi na'e sanji da poi mi pu jinvi

source: I don't know what I'd do without you.
jbo: mi na'e djuno lo du'u da'i mi ma kau zukte secau do

source: I don't know what I'm doing anymore.
jbo: mi co'u sanji tu'a da poi mi zukte

source: I don't know what I'm doing here.
jbo: mi na'e sanji tu'a da poi mi vi zukte

source: I don't know what I'm doing yet.
jbo: mi za'o na'e sanji tu'a da poi mi ca'o zukte

source: I don't know what I'm going to do yet.
jbo: mi pu'o sanji da poi mi ba zukte

source: I don't know what I'm going to do.
jbo: mi na'e sanji da poi mi ba zukte

source: I don't know what the truth is.
jbo: mi nalju'o lo du'u ma kau jetnu

source: I don't know what this is about.
jbo: mi na'e djuno lo du'u srana ma kau

source: I don't know what to believe anymore.
jbo: mi co'u djuno lo du'u .ei krici ma kau

source: He wanted change.
jbo: lo nakni pu djica lo nu tikygau

source: I doubt if it'll rain.
jbo: mi senpi lo nu ba carvi

source: I doubt if it'll snow.
jbo: mi senpi lo nu ba snime carvi

source: I drew a picture of a pony.
jbo: mi pu te pixra lo cmalu xirma

source: I drink to relax.
jbo: mi pinxe tezu'e loka surla

source: I drive a Porsche.
jbo: mi sazri la porc

source: I dropped my apple.
jbo: mi pu falgau lo plise

source: I drove all night.
jbo: mi pu karce sazri ze'a piro lo pa nicte

source: I eat here every day.
jbo: mi vi citka ca ro donri

source: I eat only when I'm hungry.
jbo: mi citka va'o po'o lo nu mi xagji

source: I eat there every night.
jbo: mi vi citka ca ro nicte

source: I enjoy chess.
jbo: mi nelci lo caxmati

source: I erased my name off the list.
jbo: mi pu vimcu lo pe mi cmene lo liste

source: I even tried writing a song about what happened.
jbo: ji'asai mi pu troci lo ka ciska lo selsanga poi skicu lo nu makau pu fasnu

source: I even wrote a letter to Tom.
jbo: ji'asai mi pu ciska lo xatra be la tom

source: I failed chemistry.
jbo: mi pu fliba tu'a lo xukmi saske

source: I fell in love.
jbo: mi pu co'a carmi prami

source: I forgot all about Tom.
jbo: mi mulno nalmorji tu'a la tom

source: I forgot my key.
jbo: mi de'a morji tu'a lo pe mi ckiku

source: Can you drive me home?
jbo: xu do mi ka'e xrubei

source: I gave it to Tom.
jbo: mu pu dunda fi la tom

source: I gave Tom all my money.
jbo: mu pu dunda fi la tom fe ro lo pe mi jdini

source: I gave up hope.
jbo: mi pu co'u pacna

source: I got married again.
jbo: mi za'ure'u co'a speni

source: I got sick last week.
jbo: mi co'a bilma ca lo prulamji jeftu

source: I had to try.
jbo: .ei mi pu troci

source: I had to work.
jbo: .ei mi gunka

source: I handed Tom a knife.
jbo: mi xance te cpacu fi la tom fe lo dakfu

source: I happen to be a good driver.
jbo: sei fasnu mi certu sazri prenu

source: I hardly know you.
jbo: mi naru'e se slabu do

source: I hate being old.
jbo: mi xebni lo ka laldo

source: I hate being single.
jbo: mi xabni lo ka speni no da

source: I hate everything about Tom.
jbo: mi xebni ro da pe la tom

source: I hate it when you fight.
jbo: mi xebni ro nu do damba

source: I hate my eyebrows.
jbo: mi xebni loi pe mi kalmebykre

source: I hate seeing you like this.
jbo: mi xebni lo nu zgana lo nu do co'e

source: I hate waiting like this.
jbo: mi xebni lo ka denpa tai zo'e bi'unai

source: I hate you both.
jbo: mi xebni ro lo re do

source: The czar was the ruler of Russia.
jbo: la .tsar. pu me lo jatna be la .rosi,ias.

source: The tsar was the ruler of Russia.
jbo: la .tsar. pu me lo jatna be la .rosi,ias.

source: When the city was liberated, people lined the streets throwing confetti.
jbo: ca lo nu lo tcadu co'a zifre kei lo prenu cu sanli vi'i lo klaji gi'e renro lo slaplespi

source: She showered him with confetti.
jbo: lo fetsi ko'a pu tercarvi lo slaplespi

source: That's not a valid argument. It's a logical fallacy.
jbo: mapti daurju'a nagi'e lojysreju'a

source: He implored her to come back.
jbo: lo nakni fi ko'a pu camcpe lo nu xrukla

source: This is the zoom button.
jbo: ti nunbrari'a batke

source: I'll gouge out your eyes!
jbo: .ai le'o mi do kalvi'u

source: The criminal attempted to launder money.
jbo: lo zerpre pu troci lo nu rupructcica

source: That's the eject button. Don't touch it.
jbo: barkla batke sei ko na pencu

source: The church teaches abstinence before marriage.
jbo: lo jdatcana cu darlu lo nunglecau pe pu lo nunspe

source: Add one teaspoon of paprika.
jbo: jmina lo parpika poi cmamuclai li pa

source: My grandfather suffers from hypertension.
jbo: lo rirpa'u be mi cu dusyda'eblubi'a

source: I want to be like her.
jbo: mi djica lo ka simsa ko'a poi fetsi

source: I want to be like him.
jbo: mi djica lo ka simsa ko'a poi nakni

source: This shampoo makes my hair shiny.
jbo: gau lo vi kerfa ve lumci lo pe mi kerfa co'a gusni minra

source: I feel like the happiest person in the world.
jbo: mi cinmo lo ka gekrai lo ro prenu pe lo munje

source: I need a key to open a box.
jbo: mi nitcu lo ckiku lo nu kargau lo tanxe

source: The more I get, the more I want. The more I want, the less I get. The less I get, the less I want. The less I want, the more I get.
jbo: lonu mi zenba cpacu kei selja'e lonu mi zenba djica .i lonu mi zenba djica kei selja'e lonu mi jdika cpacu .i lonu mi jdika cpacu kei selja'e lonu mi jdika djica .i lonu mi jdika djica kei selja'e lonu mi zenba cpacu

source: To some degree, we carry the ancient oceans in our blood.
jbo: sela'u kansa mi'o ne'i lo ciblu fa lo temda'o xamsi

source: Whatever is subject to origination is all subject to cessation.
jbo: ro da poi fancu lo nuncfa cu fancu lo nunfa'o

source: All compounded things are subject to decay.
jbo: ro selpau cu fancu lo nunfusra

source: We are what we think.
jbo: mi'o me lo menli be mi'o

source: Form is emptiness; emptiness is form.
jbo: tamkai noi kutkai .i kutkai noi tamkai

source: It is difficulties that show what people are.
jbo: ca'e ra me lo nandu poi zgagau fi lo nu lo prenu cu mokau

source: A man should be upright, not kept upright.
jbo: .ei lo prenu cu madystace gi'enai madystace bai

source: Whatever happens at all happens as it should.
jbo: ro da poi ja'a fasnu cu fasnu ki'u

source: Every man is worth just so much as the things are worth about which he busies himself.
jbo: vamji ro prenu fa lo vamji be da poi vo'a ke'a zukcfu

source: Let thy understanding enter into the things that are doing and the things which do them.
jbo: .e'u curmi lo nu do jimpe fi da poi tarti .e de poi te tarti fi da

source: Very little is needed to make a happy life.
jbo: nitcu su'onai sai da lo nu jai gau gleki nunji'e

source: The nature of the All moved to make the universe.
jbo: lo jinzi be lo me ro da pu muvdu lo nu cupra lo munje

source: I want to know how many will make me happy.
jbo: mi djica lo nu mi djuno so'i u'e da

source: If that's true about me, it's true about you.
jbo: mi na.a do go'i

source: If that's not true about you, it's not true about me.
jbo: mi na.a do go'i

source: I have to go meet with Tom.
jbo: .e'i mi klama tezu'e lo ka penmi la tom

source: I haven't told Tom.
jbo: mi na pu cusku fi la tom

source: I hope it's worth it.
jbo: a'o ra vamji

source: I don't like them one bit.
jbo: li me'i fa'i ci'i ni mi nelci ko'a

source: I know where Tom hides his money.
jbo: mi djuno lo nu vi makau la tom cu mipri lo pe ri jdini

source: What I wist I told to you.
jbo: da mi se vedli gije fi do se skicu

source: Good night.
jbo: melbi nicte di'ai

source: We are speaking about the same thing, just in different words.
jbo: za'u mi tavla fi lo mintu secu'u sa'u lo frica valsi

source: Unfortunately, I am too busy now.
jbo: uinai mi dukse tolcando ca

source: I'm certain that you saw Tom.
jbo: mi birti lo nu do pu viska la tom

source: China has Chinese characteristics.
jbo: la djunguos cu jungo bo ckaji

source: Somebody called. Guess who?
jbo: da pu fonta'a .i ko smadi lo du'u ma kau go'i

source: I heard something, but I couldnt tell what it was.
jbo: mi pu tirna da .i ku'i mi pu na kakne lo nu facki lo du'u da mo kau

source: You must try somewhere else.
jbo: .ei do troci bu'u lo drata

source: Did anybody tell you anything about it?
jbo: xu da do pu jungau de la'e di'u

source: If you see anybody, tell me immediately.
jbo: va'o lo nu da'i do viska su'o prenu zo'u ko mi ba zi sai jungau

source: John is taller than anybody.
jbo: la .djon. cu zmadu ro da lo ka clani

source: John didnt see anybody.
jbo: la .djon. pu na viska da

source: I dont think that anybody knows the answer.
jbo: mi jinvi lo du'u na ku da djuno lo du'u ma kau danfu

source: The bank avoided taking any decision.
jbo: lo banxa catni cu rivbi lo nu jdice da

source: You may kiss anybody.
jbo: ro da zo'u .e'a do da cinba

source: John kissed any woman with red hair.
jbo: la .djon. pu cinba ro ma'urni'u poi lo xunre ke'a kerfa zi'e poi penmi

source: Every dog has four legs.
jbo: lo gerku cu se tuple vo da

source: I don't want to sleep with just anybody anymore.
jbo: mi na za'o djica lo nu mi gletu lo na slabu be mi

source: She's wearing red.
jbo: ko'a dasni lo xunre

source: He's standing behind his mother.
jbo: ko'a sanli ti'a le matma be ko'a

source: He's not very good at remembering names.
jbo: ko'a na xamgu lo ka morji fi lo cmene

source: Thanks for helping me!
jbo: ckire fi lo ka sidju mi

source: I just wish I could sleep.
jbo: mi djica fe po'o lo nu mi kakne lo ka sipna

source: I just wish I knew how to speak French.
jbo: .au mi se frasybau

source: I just wish it wasn't so expensive.
jbo: mi djica fe po'o da'i lo nu ko'a na tai kargu

source: I just work here.
jbo: sa'u mi gunka vi

source: I knew there was a reason.
jbo: mi pu djuno lo du'u da krinu

source: I knew who he was.
jbo: mi pu djuno lo nu ra mokau

source: I know what Tom is looking at.
jbo: mi djuno lodu'u la tam cu catlu makau

source: I know where to find you.
jbo: mi djuno lodu'u bu'u makau tolcri do

source: I know you're guilty.
jbo: sei mi djuno do zerfu'e

source: I know you're happy.
jbo: sei mi djuno do gleki

source: I know you're hungry.
jbo: sei mi djuno do xagji

source: I know you're innocent.
jbo: sei mi djuno do zernalfu'e

source: I know you're shocked.
jbo: sei mi djuno do seljenca

source: I know you're Tom.
jbo: sei mi djuno do tom

source: I know you're writing a book.
jbo: sei mi djuno do ca'o ciska lo cukta

source: I know you've got a gun.
jbo: sei mi djuno do co'a ralte lo se danti

source: I know your problem.
jbo: mi se slabu lo nabmi pe do

source: Either skillful or lazy. But not both.
jbo: certu jonai lazni

source: The door was closed.
jbo: lo vorme pu ganlo

source: I like cold pizza.
jbo: mi nelci lo lenku pitsa

source: I like it here.
jbo: mi nelci lo vi stuzi

source: Pessimists say "I'm not rich." Optimists say "I'm not rich at the moment."
jbo: .i lo mabla kanpe cu cusku lu .i mi na ricfu li'u .i lo zabna kanpe cu cusku lu .i mi na'e ca ricfu li'u

source: I persuaded Tom to help me.
jbo: mi pu xlura la tom lo ka sidju mi

source: I plan on being early.
jbo: mi termu'i lo ka jai clira

source: I plan on winning.
jbo: mi termu'i lo ka jinga

source: I play a little guitar.
jbo: mi zgipli lo cmalu jgita

source: I play basketball with Tom.
jbo: mi jo'u la tom cu kelci la baskedbol

source: I pretended to work.
jbo: mi smitra lo ka gunka

source: I promise I'll be quiet.
jbo: mi nupre lo nu mi ba smaji

source: I promise I'll pay you back.
jbo: mi nupre lo nu mi ba xruti pleji lo se dejni do

source: I promise I'll try.
jbo: mi nupre lo ka troci

source: I promise not to sing.
jbo: mi nupre lo ka na sanga

source: I promise you I won't do it again.
jbo: mi nupre fi do fe lo ka na za'ure'u zukte da bi'unai

source: I put it in your room.
jbo: mi punji ra lo pe do kumfa

source: I remember both of you.
jbo: mi morji tu'a ro lo re do

source: I remember it now.
jbo: mi ca ca'o co'a morji

source: I remember this music.
jbo: mi vedli tu'a lo vi zgike

source: I remember Tom well.
jbo: mi birti morji tu'a la tom

source: I remember what I saw.
jbo: mi vedli lo nu mi pu viska makau

source: My name isn't Tom.
jbo: mi na se cmene la tam.

source: The people living in that village habitually carry together several heaps of nuts, each heap being of the size of a net that is formed by two people's four hands.
jbo: lo xabju be lo bi'u nai cmatca cu ta'e kansi'u lo nu bevri lo narge me lo vo xance be lo re prenu be'o poi se tarmi lo julne mei li so'o

source: I think Tom is in love.
jbo: pe'i la .tam. pamcni

source: I think we're going to be late.
jbo: mi jinvi lo nu za'u mi ba jai lerci

source: We can only afford to buy a small car at the moment.
jbo: mi'a ca ricfu lo ka te vecnu lo cmalu po'o karce

source: How do you say "I love you" in French?
jbo: ma xe fanva lu mi prami do li'u lo frasybangu

source: Come back here!
jbo: ko vi xruti

source: This is a secret.
jbo: ti sivni

source: Boston is a dangerous city.
jbo: la boston cu ckape tcadu

source: The glass is empty.
jbo: lo blaci cu kunti

source: You two are my best friends.
jbo: re do mi traji pendo

source: We should eat.
jbo: ei za'u mi citka

source: The woman is young.
jbo: le ninmu cu citno

source: Can you speak Uyghur?
jbo: xu do se bangu la uigur

source: I am aware, and aware that I am aware, and aware that I am aware that I am aware ...
jbo: mi nei sanji

source: We shouldn't spend money.
jbo: ei na xaksu lo jdini

source: I want more milk.
jbo: mi ladru za'umei djica

source: A skyful isn't enough to have written upon it that I love you.
jbo: lo me lo tsani mei cu na'e banzu lo ka te ciska lo se du'u mi do prami

source: It's the best way to solve the problem.
jbo: da bi'unai xagrai tadji lo nu danfu facki

source: Have a nice sleep!
jbo: lo pluka ko li'i sipna

source: I didn't want to give Tom any money.
jbo: mi djica lo ka dunda fi la tom su'o lo jdini

source: Tom teaches French to children.
jbo: la tom ctuca fi lo fraso fe lo verba

source: Tom can sing some French songs.
jbo: la tom cu kakne lo ka sanga su'o so'o lo fraso selsanga

source: I know a man who speaks French.
jbo: mi se slabu lo prenu noi se frasybau

source: You have to speak French here.
jbo: do .e'i tavla bau lo fraso vi

source: Stop saying bullshit!
jbo: ko sisti lo ka cusku lo se bebna

source: Mary and Alice are sisters.
jbo: la .meris. joi la .alis. cu mensi remei

source: It's very dangerous.
jbo: mutce ckape

source: I don't live in Turin.
jbo: mi na xabju la torinos

source: Aluminum is a metal.
jbo: lo alminiu cu jinme

source: What will we do, when you get here?
jbo: za'u mi ma zukte ca lo nu do ti ba'o tolcliva

source: Only the one who tries succeeds. But the one who only tries fails.
jbo: .i lo troci ku po'o snada .i ku'i lo troci po'o ku fliba

source: The file is weighing 7 megabytes.
jbo: .i le sfaile cu pi'ai megdo skamrbaiti li 7

source: The sky was so starry, so bright that, looking at it, one could not help asking oneself whether ill-humoured and capricious people could live under such a sky.
jbo: lo tsani puku tarci ckaji gije carmi vau tai lo nu fau lo nu da catlu ty kei da co'a reisku fi lo nei fe lo se du'u xukau lo se ke xlali je cunso cnitcini ke'e prenu ka'e xabju ni'a le tai tsani

source: There's no rest for the wicked.
jbo: .i no da nu surla fa lo palci

source: This topic is appealing to many.
jbo: le se datni cu trina so'i da

source: My hair is wet.
jbo: le mi kerfa cu cilmo

source: Lojban is alive only because problems in it continue to exist.
jbo: lo jbobau ca'o jmive ki'u po'o lo nu lo jbobau nabmi ca'o zasti

source: Fish is expensive.
jbo: lo finpe cu kargu

source: Meat is expensive.
jbo: lo rectu cu kargu

source: It's up to 510- meters.
jbo: mitre be li ni'u ci gei su'e mu

source: By saying "Mike" I actually meant my dog named Mike.
jbo: fi mi zo maik poi mi pu cusku cu smuni je'u zo maik poi cmene lo gerku pe mi

source: I would never be your husband.
jbo: mi no mu'ei speni do

source: I would never be your wife.
jbo: mi no mu'ei speni do

source: The meat is expensive.
jbo: lo rectu cu kargu

source: You jumped high enough.
jbo: do banzu lo ka plipe fo makau

source: You jumped high enough to touch this branch.
jbo: do banzu lo ka plipe fo makau kei lo nu pencu lo va tricu jimca

source: Dibs I go first!
jbo: ca'e mi pamoi klama

source: It's unbelievably beautiful!
jbo: .ue sai melbi

source: I will be here two hours later than previously said.
jbo: .i mi ba vi zvati ba lo jai se cusku za lo cacra be li re

source: I will be here two hours earlier than previously said.
jbo: .i mi ba vi zvati pu lo jai se cusku za lo cacra be li re

source: Where is Laurie?
jbo: ma se zvati la'oi Laurie

source: I was angry.
jbo: mi pu fengu

source: Those who try to be foolish are foolish.
jbo: .i lo nei troci cu bebna

source: Both of you are right.
jbo: ro lo re do drani

source: It's not important to me what you decide to call me.
jbo: na vajni mi fa lo nu do jdice lo ka te cmene mi makau

source: We were a perfect couple.
jbo: mi'ai prane remei

source: It's a common mistake.
jbo: fadni se srera

source: There is some work to do.
jbo: da me lo se gunka noi .ei zukte

source: I ate only bananas.
jbo: mi citka lo badna ku po'o

source: All I ate was bananas.
jbo: ro lo selcti be mi cu badna

source: This is a quiet street.
jbo: ti smaji klaji

source: Your daughters are beautiful.
jbo: za'u lo do tixnu cu melbi

source: I want to go home.
jbo: mi djica tu'a lo zdani

source: What can you buy at the market?
jbo: do ka'e tervecnu ma bu'u lo zarci

source: You are right.
jbo: do drani

source: Tom is likely to pass today's exam.
jbo: sei lakne la tom ba snada tu'a lo cabdei cipra

source: One hour until the event.
jbo: me le fasnu baza lo cacra be li pa

source: The tea is getting cold due to the cold air.
jbo: lo tcati cu jdika lo ni glare kei ri'a tu'a lo lenku vacri

source: Oh, I got it.
jbo: ua bu'o je'e

source: Don't sleep with her just because you want to.
jbo: ko na gletu ko'a mu'i po'o lo nu do djica

source: Don't sleep with her, because you'll catch an STD.
jbo: ko gletu ko'a mu'i lo nu do cinbi'abi'o da'i kei naku

source: I like beautiful things even if they are umbrellas.
jbo: .i mi nelci lo melbi ju santa

source: I'd very much like to know your opinion.
jbo: da'i mi mutce djica lo ka djuno lo se jinvi be do

source: Tom apparently likes Mary a lot.
jbo: la tom cu nelci li'a la maris soi mutce

source: I'll tell you when I get back.
jbo: mi ba cusku fi do ca lo nu mi tolcliva

source: I was thinking the same thing.
jbo: mi pu ca'o pensi lo mintu

source: I'm going to go sit down.
jbo: mi termu'i lo ka klama co zutse

source: I thought you looked sad.
jbo: mi pu jinvi lo nu do ca simlu lo ka badri

source: You're a bright boy.
jbo: do stati nanla

source: Tom's a bright boy.
jbo: la tom cu stati nanla

source: I was just looking.
jbo: mi pu catlu po'o

source: We're in no hurry.
jbo: mi'ai nova'e lo ni sutra

source: We have good jobs.
jbo: mi'ai se ke xamgu jibri

source: We have a problem.
jbo: da nabmi mi'ai

source: We aren't friends.
jbo: mi'ai na pendo

source: Tom must be angry.
jbo: ja'o ju'o la tom cu fengu

source: Thanks a lot, Tom.
jbo: mutce ckire doi tom

source: Strange, isn't it?
jbo: cizra je'upei

source: Nobody was around.
jbo: no prenu pu jibni

source: My knife is sharp.
jbo: lo mi dakfa cu kinli

source: It was a pleasure.
jbo: ra pu jai pluka

source: It isn't a secret.
jbo: ra na zilmipri

source: Is everyone happy?
jbo: xu ro da gleki

source: I'm Tom's partner.
jbo: mi la tom cu kamxada

source: I'm tired of this.
jbo: mi tatpi da bi'ucu'i

source: I'm sort of happy.
jbo: mi sorta gleki

source: I'm sorry I asked.
jbo: u'u mi pu reisku

source: I'm ready to talk.
jbo: mi bredi lo ka tavla

source: I'm now your boss.
jbo: nau mi do jatna

source: I'm not in a rush.
jbo: mi na sutra ei

source: I'm not a patient.
jbo: mi na selmikce

source: I'm kind of tired.
jbo: mi kinda tatpi

source: I'm here now, Tom.
jbo: mi vi nau doi tom

source: I'm going to swim.
jbo: mi termu'i lo ka limna

source: I'm getting tired.
jbo: mi tatpi zenba

source: I'm aware of that.
jbo: mi sanji da bi'unai

source: I'm an old friend.
jbo: mi laldo pendo

source: I'm a member here.
jbo: mi cmima vi

source: I'm a hard worker.
jbo: mi tolylazni gunka

source: I'll sit with Tom.
jbo: mi ba zutse ka'ai la tom

source: I was on the road.
jbo: mi pu bu'u lo dargu

source: Tom was friendly.
jbo: la tom pu pendo tarti

source: Tom thanked Mary.
jbo: la tom pu ckire la maris

source: Tom never saw it.
jbo: la tom pu noroi viska da bi'unai

source: Tom needed a job.
jbo: la tom pu nitcu lo se jibri

source: Tom looked dirty.
jbo: la tom pu simlu lo ka toljinsa

source: Tom left quietly.
jbo: la tom pu cliva co smaji

source: Tom isn't hungry.
jbo: la tom na xagji

source: Tom hit me first.
jbo: la tom pu pamoi darxi mi

source: Tom has children.
jbo: la tom cu se panzi za'u da

source: Tom has a family.
jbo: la tom cu se lanzu da

source: Tom had to hurry.
jbo: la tom ei pu co'a sutra

source: This isn't a map.
jbo: ti na cartu

source: They were crying.
jbo: za'u ra pu ca'o klaku

source: They looked good.
jbo: za'u ra pu simlu lo ka xamgu

source: They didn't talk.
jbo: za'u ra na pu tavla

source: The sky was gray.
jbo: lo tsani pu grusi

source: School's not fun.
jbo: lo ckule cu na jai zdile

source: Scary, wasn't it?
jbo: pu tepygau iepei

source: It wasn't a joke.
jbo: pu na xajmi selsku

source: It was dark blue.
jbo: pu manku blanu

source: It was a miracle.
jbo: pu makfa

source: I'm sure of this.
jbo: mi birti da bi'unai

source: I'm sure of that.
jbo: mi birti ra

source: I'm ready to die.
jbo: mi bredi lo ka co'a morsi

source: I'm proud of Tom.
jbo: mi jgira tu'a la tom

source: I'm not so brave.
jbo: mi na tai virnu

source: I'm not like Tom.
jbo: mi na simsa la tom

source: I'm not her type.
jbo: mi na klesi zo'ei ra poi fetsi

source: I'm not a member.
jbo: mi na cmima

source: I'm in pain here.
jbo: mi cortu vi

source: I'm in my office.
jbo: mi ca bu'u lo mi briju

source: I'm here to stay.
jbo: mi vi zvati tezu'e lo ka stali

source: I'm good at this.
jbo: mi xamgu kakne ra pe puziku

source: I'm good at that.
jbo: mi xamgu kakne ra pe puzaku

source: I'm glad to help.
jbo: mi gleki lo ka sidju

source: I'm at the house.
jbo: mi bu'u lo dinju

source: I'm at the hotel.
jbo: mi bu'u lo xotli

source: I'll take it now.
jbo: mi lebna ra ca
